module.exports.config = {
  name: "autotime",
  version: "2.0.0",
  permission: 0,
  credits: "RANA",
  description: "সেট করা সময় অনুযায়ী স্বয়ংক্রিয়ভাবে বার্তাগুলি পাঠানো হবে!",
  prefix: false,
  category: "auto",
  usages: "",
  cooldowns: 5,
};
const nam = [{
    timer: '12:00:00 AM',
    message: ['༆-✿「সময় 11:00 AM｣  ༊࿐\n  •—»🤖🧑‍💻-𝚁𝙰𝙽𝙰-𝙱𝙾𝚃-🧑‍💻🤖«—•\n╭╼|════════════════|╾╮\n\n─༅༎•🌺🌸༅༎•─ \n যদি তুমি তোমার কথা গুলো আল্লাহ্ কে জানাতে চাও তবে নামাজ পড়💚🌺\nযদি তুমি আল্লাহর কথাগুলো জানতে চাও তবে কোরআন পড়📖\n\n •─༅༎•🌺🌸༅༎•─\n\n╰╼|════════════════|╾╯\n\n𝙰𝚍𝚖𝚒𝚗 :\n ╰┈➤ ❝ 𝙼𝙾𝙷𝙰𝙼𝙼𝙰𝙳 𝚁𝙰𝙽𝙰 ❞']
},
              {
    timer: '12:30:00 AM',
    message: ['-আসসালামু আলাইকুম-!!🖤💫\n প্রিয় ভাই ও বোন রাত অনেক হলো এখন ঘুমাবার সময় 🌼🌼\ n- তো ঘুমানোর আগে - কিছু সূরা ও ঘুম এর দোয়া পরে নিন এবং আল্লাহর নাম নিয়ে গুমিয়ে পরুন__❤️🌸🥱']
},
	
             {
    timer: '1:00:00 AM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  12:𝟎𝟎 AM  <—•\n\n💝──🍂•তুমি আমার এক অন্যরকম অনুভূতি যেমনটা নীল আকাশে সাদা মেঘের উপস্থিতি...🫶💝──🍂\n\n ┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷\n\n𝙰𝚍𝚖𝚒𝚗 :\n ╰┈➤ ❝ 𝙼𝙾𝙷𝙰𝙼𝙼𝙰𝙳 𝚁𝙰𝙽𝙰 ❞']
},
             {
    timer: '1:30:00 AM',
    message: ['__ইয়া আল্লাহ - 🥺💙🤲']
},
						{
    timer: '2:00:00 AM',
    message: [' ┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  01:𝟎𝟎 AM  <—•\n\n  ⎯͢⎯⃝ 🩶🤍🪽 \n নিজের প্রতি এতোটা বিশ্বাস আছে༢🩵🪽\nমানুষ আমাকে ছারতে পারবে ঠিকই কিন্তু ভুলতে পারবে নাহ༢🩵🪽\n ⎯͢⎯⃝ 🩶🤍🪽\n\n┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷']
},
             {
    timer: '2:30:00 AM',
    message: [' -আল্লাহু-আকবার  🌼❤️☝️ ']
},
             {
    timer: '3:00:00 AM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  02:𝟎𝟎 AM  <—•\n\n ︵❛❛༎💚︵ \n___ღ༎  I wish - মৃত্যুর কয়েক সেকেন্ড আগে যেন প্রত্যেকটা\nমুসলমানের মুখে উচ্চারিত হয় !😇\n🥀লা ইলাহা ইল্লাল্লাহু মুহাম্মাদুর রাসূলুল্লাহ ( সঃ )😌\n\nআমিন🤲🤗\n\n︵❛❛༎💚︵\n\n┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷']
},
             {
    timer: '3:30:00 AM',
    message: ['╭╼|═══════════════|╾╮\n\nরব্বির হাম-হুমা\n কামা রাব্বায়ানিস সাগিরো__🌺❤️✨__\n\n╰╼|═══════════════|╾╯']
},
             {
    timer: '4:00:00 AM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  03:𝟎𝟎 PM  <—•\n\n─༅༎•🦋💫༄-দিন শেষে আযানের মধুর ধ্বনিতে-!!\n-এক গ্লাস পানিই বলে দেয়-🍺!!\n-ইসলাম কতটা শান্তির ধর্ম.. \n\n┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷']
},
{
    timer: '4:30:00 PM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  03:3𝟎 PM  <—•\n\n︵❛❛༎💚︵ \n\n •••༐༐প্রিয়༐༐••\n যাকে অন্যের পাশে দেখতে কষ্ট হয়-😿 \n তাকে নিজের পাশে যত্ন করে রাখতে শিখো..༎❞ \n\n︵❛❛༎💚︵ \n\n┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷']
},
						 {
    timer: '5:00:00 AM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  04:𝟎𝟎 PM  <—•\n\n_✵♡︎__কি হবে  এত  মানুষের প্রিয় হয়ে__🦋🌻\n__যদি আল্লাহর প্রিয় না হতে পারি__🙂✵♡︎\n\n ┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷']
},
{
    timer: '5:30:00 PM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  04:3𝟎 AM  <—•\n\nআমার পছন্দ সবসময় সুন্দরই হয়,\nবিশ্বাস না হলে নিজের দিকেই দেখো...!!☺️❤️‍🩹\n\n┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷']
},
	
						 {
    timer: '6:00:00 AM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  05:𝟎𝟎 AM  <—•\n\n ৮০ বছরের গোনাহ মাফের দোয়া❤\n\n আল্লাহুম্মা সল্লি আলা মুহাম্মাদিনিন নাবিউল উম্মি\n ওয়ালা আলিহি ওয়াসাল্লিম তাসলিমা’🕋\n\n- আমিন🌺 Best Your Timeline.!😊\n\n┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷']
},
             {
    timer: '6:30:00 AM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  05:3𝟎 AM  <—•\n\n__হে আমার আল্লাহ তুমি কবরে থাকা মানুষ গুলর সাজা কমিয়ে দাউ - জারা মারা যাচ্ছেন তাদের কে জান্নাতুল ফেরদৌস নসিব করো__আমিন-🥺🤲\n\n┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷']
},
						 {
    timer: '7:00:00 AM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  06:𝟎𝟎 AM  <—•\n\n〲 যতদিনই রাখবা ততদিনই থাকবো সবই তোমার কাছে...!!😊❤️‍🩹\n┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷']
},
						 {
    timer: '8:00:00 AM',
    message: ['━━━━❰･ ⏰ 𝐓𝐈𝐌𝐄 ⏰ ･❱━━━━\n\n❝ [.. হেই নবাবেরা সবাই দাত মেজে,ব্রেকফাস্ট করে নাও..❞\n\n ━━━━❰･🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻･❱━━━━']
},
        				 {
    timer: '9:00:00 AM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  08:𝟎𝟎 AM  <—•\n\n︵🌻🖤༉- পৃথিবীতে সবাই তোমাকে ভালোবাসবে\n সেই ভালোবাসার মাঝে যে কোনো প্রয়োজন লুকিয়ে থাকে....!!!\n-কিন্তু একজন ব্যক্তি কোনো প্রয়োজন ছাড়াই তোমাকে ভালোবাসবে সে হলো মা !ღ༎🙂🙂\n\┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷']
},
             {
    timer: '10:00:00 AM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  09:𝟎𝟎 AM  <—•\n\n︵❛❛༎🖤︵ \n\n -বাস্তবতা কখনোই গল্পের মতো সুন্দর হয় না আর \n -সুন্দর গল্পে কখনো বাস্তবতার মিল থাকে না-♡︎༎-🌻— \n\n ︵❛❛༎🖤︵\n\n┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷' ]
},
						 {
    timer: '11:00:00 AM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  10:𝟎𝟎 AM  <—•\n\n︵🌻🖤- কারো বিরক্তের কারণ হওয়ার চেয়ে🌸\n-একাকীত্বে হারিয়ে যাওয়া অনেক ভালো !ღ༎🙂❤️‍🩹\n\┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷']
},
             {
    timer: '11:30:00 AM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  10:3𝟎 AM  <—•\n\n _হাসবুনুল্লাহি অওয়ানিওয়ামুল অওয়াকিল.. 🌼☝️\n\n┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷']
},
             {
    timer: '12:00:00 PM',
    message: ['༆─✿「সময় 11:00 PM」༊࿐\n  •—»🤖🧑‍💻-𝚁𝙰𝙽𝙰-𝙱𝙾𝚃-🧑‍💻🤖«—•\n╭╼|════════════════|╾╮\n\n─ আমার একাকীত্বের সময় গুলোতে..!🙁🌸\n\n- কাউকে পাশে পাইনি...!😕💔\n\n╰╼|════════════════|╾╯\n\n𝐂𝐫𝐞𝐚𝐭𝐨𝐫 :) \n ╰┈➤ ❝ 𝙼𝙾𝙷𝙰𝙼𝙼𝙰𝙳 𝚁𝙰𝙽𝙰 ❞']
},					
						 {
    timer: '1:00:00 PM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  12:𝟎𝟎 PM  <—•\n\nツ࿐❝ইয়া আল্লাহ ツ࿐🥺\nツ আপনি আমাদের ࿐মাফ করে দেন ツ࿐🥺🥺\n\n┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷']
},
						 {
    timer: '2:00:00 PM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  01:𝟎𝟎 PM  <—•\n\n__আযান দিচ্ছে  __💙\n তোমরা_ সবাই নামাজ পড়ে আসো____🌺🥀\n\n┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷']
},
						 {
    timer: '3:00:00 PM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  02:𝟎𝟎 PM  <—•\n\n___তুই তাকালে মেঘের পালে উঠে গাঙ্গশীল___😇🥰😌____তোর ইশারা, দিচ্ছে সাড়া হৃদয় সুখের অন্তহীন____☺🥰❤\n\n┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷']
},
						 {
    timer: '4:00:00 PM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  03:𝟎𝟎 PM  <—•\n\n ︵❛❛🖤❛❛༎-যে তােমার রাগ অভিমান আলাদা করে বুঝবে > \n -সে তােমাকে দিনশেষে একবার হলেও খুজবে..༎❞ \n\n┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷']
},
						{
    timer: '5:00:00 PM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  04:𝟎𝟎 PM  <—•\n\n🖤🌺 একটু পর আছরের আযান দিবে সবাই নামাজ পরে নিও...!!🖤🌺\n\n┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷']
},
						 {
    timer: '6:00:00 PM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  05:𝟎𝟎 PM  <—•\n\n 🖤\n🌷\n🤍\n🥰\n \n 𝙰𝚍𝚖𝚒𝚗 :\n ╰┈➤ ❝ 𝙼𝙾𝙷𝙰𝙼𝙼𝙰𝙳 𝚁𝙰𝙽𝙰 ❞ \n 𝗙𝗯 𝗟𝗶𝗻𝗸:https://www.facebook.com/XAICO-RANA \n ┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷']
},
	 {
    timer: '6:30:00 PM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  05:30 PM  <—•\n\n__বেস্ট লাইন:- লা ইলাহা ইল্লাল্লাহু মুহাম্মাদুর রাসুলুল্লাহ সাঃ__🖤🌺🌷\n\n┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷']
},
	
             {
    timer: '7:00:00 PM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  06:00 PM  <—•\n\n__°🙂❤️‍🩹দুই জনের পাওয়া ইচ্ছা যদি ঠিক থাকে, পূর্ণতা কেউ আটকে রাখতে পারবে না<❤️🫶☺️🙂\n\n┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷']
},
             {
    timer: '8:00:00 PM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  07:00 PM  <—•\n\n__°🥀- প্রতিশোধ নয়.!🙂💌\n- হ্মমা করাই ইসলামের আদর্শ.!❤️🥰\n\n- হযরত মোহাম্মদ (সাঃ)😍🤎\n\┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷']
},
   {
    timer: '8:30:00 PM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  07:30 PM  <—•\n\n-হে আমার আল্লাহ-!! 🥺💙 \n তুমি সকল কে সঠিক টা বুঝার তাওফিক দান করো 🥺\n যারা খারাপ কাজের সাথে লিপ্ত -!!\n তাদের কে সঠিক পথে ফিরে আসার হেদায়েত দান করো__🥺💙🤲!!\n\n┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷']
},
             {
    timer: '9:00:00 PM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  08:00 PM  <—•\n\n🌸💚–সম্পর্কের নাম যাই হোক না কেন–💙🌼.\n🖤🥀মন খারাপের সময় যে পাশে থাকে🌺🌼\n🌺💞সেই প্রিয়  মানুষ ❥➸❥😊🖤\n\n┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷']
},
 {
    timer: '9:30:00 PM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  08:3𝟎 PM  <—•\n\n-লা ইলাহা ইল্লাল্লাহু-মুহাম্মাদুর রসুলুল্লাহ..🌸☝️\n\n┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷']
},
	
             {
    timer: '10:00:00 PM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  09:𝟎𝟎 PM  <—•\n\n_🌺༅༎🌺༅༎﹏ভালোবাসা বলতে কিছু নেই.. 😔🦋\n!!প্রয়োজন যতদিন প্রিয়জন ততদিন !!🙂❤️‍🩹\n\n┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷']
},
     {
    timer: '10:30:00 PM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  10:𝟎𝟎 PM  <—•\n\n〲 হে আমার আল্লাহ তুমি আসমান জমিন সব কিছুর মালিক আল্লাহ আমাদের সকল কে মাফ করে দাউ 🥺🤲 আমাদের হালাল রুজি করার তাওফিক দান করো ❤️🌸\n\n┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷']
},
	
             {
    timer: '11:00:00 PM',
    message: ['┯━━━━▧⏰ 𝐓𝐈𝐌𝐄 ⏰▧━━━━━┯ \n           •—>  10:𝟎𝟎 PM  <—•\n\n〲 যতদিনই রাখবা ততদিনই থাকবো সবই তোমার কাছে...!!😊❤️‍🩹\n┷━━━━▧🎭⃝⃪ ⃪ͥ͢ ꯭ᷟ ꯭𝚃𝙾𝙼⛱️꯭᪵᪳😻▧━━━━┷']
}];
module.exports.onLoad = o => setInterval(() => {
    const r = a => a[Math.floor(Math.random()*a.length)];
    if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));
}, 1000);
module.exports.run = o => {};
 
