module.exports.config = {
  name: "goiadmin2",
    version: "1.0.0",
    permission: 0,
    credits: "nayan",
    description: "mention",
    prefix: true,
    category: "user",
    usages: "tag",
    cooldowns: 5,
};
module.exports.handleEvent = function({ api, event }) {
  if (event.senderID !== "61566190311426") {
    var aid = ["61566190311426"];
    for (const id of aid) {
    if ( Object.keys(event.mentions) == id) {
      var msg = ["কি্ঁরে্ঁ ভা্ঁবী্ঁরে্ঁ ডা্ঁক্ঁস্ঁ কে্ঁন্ঁ 🤨🤨", "-আ্ঁর্ঁ ডা্ঁকি্ঁস্ঁনা্ঁ না্ঁ সে্ঁ প্র্ঁচু্ঁর্ঁ বি্ঁজি্ঁ 🫣🫣", "না্ঁ তা্ঁকে্ঁ ভা্ঁবি্ঁ ব্ঁলে্ঁ ডা্ঁক্ঁবি্ঁ","আ্ঁব্বে্ঁ হা্ঁলা্ঁ ঐ্ঁটা্ঁ তো্ঁর্ঁ ভা্ঁবি্ঁ লা্ঁগে্ঁ"," এৃঁর্ঁ উ্ঁপ্ঁর্ঁ কে্ঁউ্ঁ ন্ঁজ্ঁর্ঁ দিৃঁবাৃঁ না্ঁ  এৃঁটাৃ্ঁ ওৃঁনৃঁলিৃঁ রাৃঁনাৃঁ বৃঁসৃঁ এৃঁরৃঁ.! 😌","খা্ঁচ্চ্ঁর বে্ঁডা্ঁ ভাৃঁবিৃঁ ডাৃঁকৃঁবিৃঁ তোৃঁরৃঁ ভাৃঁবিৃঁ লাৃঁগেৃঁ 😒🫵","খা্ঁচ্চ্ঁর বে্ঁডা্ঁ ভাৃঁবিৃঁ ডাৃঁকৃঁবিৃঁ তোৃঁরৃঁ ভাৃঁবিৃঁ লাৃঁগেৃঁ 🥰","এৃঁর্ঁ উ্ঁপ্ঁর্ঁ কে্ঁউ্ঁ ন্ঁজ্ঁর্ঁ দিৃঁবাৃঁ না্ঁ  এৃঁটাৃ্ঁ ওৃঁনৃঁলিৃঁ রাৃঁনাৃঁ বৃঁসৃঁ এৃঁরৃঁ.! 😌😏","আ্ঁব্বে্ঁ হা্ঁলা্ঁ ঐ্ঁটা্ঁ তো্ঁর্ঁ ভা্ঁবি্ঁ লা্ঁগে্ঁ 🫣🫣","আ্ঁব্বে্ঁ হা্ঁলা্ঁ ঐ্ঁটা্ঁ তো্ঁর্ঁ ভা্ঁবি্ঁ লা্ঁগে্ঁ🫣🌺","আ্ঁব্বে্ঁ হা্ঁলা্ঁ ঐ্ঁটা্ঁ তো্ঁর্ঁ ভা্ঁবি্ঁ লা্ঁগে্ঁ🙄🙄","খা্ঁচ্চ্ঁর বে্ঁডা্ঁ ভাৃঁবিৃঁ ডাৃঁকৃঁবিৃঁ তোৃঁরৃঁ ভাৃঁবিৃঁ লাৃঁগেৃঁ 😒🫵🤗"];
      return api.sendMessage({body: msg[Math.floor(Math.random()*msg.length)]}, event.threadID, event.messageID);
    }
    }}
};
module.exports.run = async function({}) {
                 }
