module.exports.config = {
  name: "😍",
  version: "1.0.2",
  permission: 2,
  credits: "nayan",
  prefix: false,
  description: "",
  category: "prefix",
  usages: "/jan",
  cooldowns: 5
};

module.exports.run = async function({ api, args, Users, event}) {
    var mention = Object.keys(event.mentions)[0];
    if(!mention) return api.sendMessage("বস আপনি যাকে ভালোবাসেন তাকে ম্যানশন দেন", event.threadID);
 let name =  event.mentions[mention];
    var arraytag = [];
        arraytag.push({id: mention, tag: name});
    var a = function (a) { api.sendMessage(a, event.threadID); }
a("Jan I Love You, উম্মাহ্ জানু রানা এর ভালোবাসা নাও");
setTimeout(() => {a({body: "তোমাকে দেখলে আমার এত ভালো লাগে কেন জান আমি কিছুই তো বুঝতে পারি না💚 । 🥰।" + " " + name, mentions: arraytag})}, 3000);
setTimeout(() => {a({body: "‎টমেটো লাল কাঁচা মরিচ ঝাল তোমার বুকের মাঝে চুমু দেবো আমি চিরকাল জান🙈🥀🥰   😍.." + " " + name, mentions: arraytag})}, 5000);
setTimeout(() => {a({body: "‎༉༎༉😽!!লাইন টা তুমার জন্য  ডুবেছি আমি তুমার প্রেমের অনন্ত মায়ায় 🙈 ༅༎•❤️🌸🐰" + " " + name, mentions: arraytag})}, 7000);
setTimeout(() => {a({body: "‎দিন শেষে আমার তোমাকেই লাগবে😽!" + " " + name, mentions: arraytag})}, 9000);
setTimeout(() => {a({body: "~🖤এক আকাশ সমান স্বপ্ন নিয়েতোমাকে ভালোবাসি প্রিয়🐰🦋🥰" + " " + name, mentions: arraytag})}, 12000);
setTimeout(() => {a({body: "ছেড়ে যাওয়ার যুগে সবার একটা থেকে যাওয়ার মানুষ হোক!💖আপনি আমার সে মানুষ🥀🌸 " + " " + name, mentions: arraytag})}, 15000);
setTimeout(() => {a({body: "- সত্যি কারের ভালোবাসা গুলো এমনই হয় 😍🥀- কেউ কাউকে ছেড়ে যায় না শেষ পর্যন্ত থাকে 😊❤️i Love You Jan😘" + " " + name, mentions: arraytag})}, 17000);
setTimeout(() => {a({body: "ডুবেছি আমি তোমার চোখের অন্তত মায়ায় 👀❤️‍🩹 🤟" + " " + name, mentions: arraytag})}, 20000);
setTimeout(() => {a({body: " যেদিন তুমি সবকিছু বুঝতে পারবে - সেদিন আমি রানা থাকবো না! 🙂🌸 " + " " + name, mentions: arraytag})},23000);
setTimeout(() => {a({body: "- খুব জানতে ইচ্ছে করে.😥🌸 - কি লেখা আছে আমার এই জীবনের শেষের পাতায়.!💔😌" + " " + name, mentions: arraytag})},26000);  
setTimeout(() => {a({body: "︵🦋シ-𝐃𝐨𝐧'𝐭 𝐂𝐫𝐲 𝐅𝐨𝐫 𝐒𝐨𝐦𝐞𝐨𝐧𝐞..!😇🙂-  𝘁𝗵𝗶𝘀 𝗮𝗯𝗼𝘂𝘁 𝗹𝗶𝗻𝗲 🐰✨ দিন শেষে আমি আমার  তোমাকেই লাগবে😊🦋︵🦋❤️‍🩹" + " " + name, mentions: arraytag})},29000);
  setTimeout(() => {a({body: "-︵🦋🤍___ღ༎হারিয়ে গেলে কেউ খুজবে না︵ღ۵__🙂 অথচ সবাই বলে তুমি হারিয়ে গেলে খুব Miss করবো___ღ༎🙂🦋🥀" + " " + name, mentions: arraytag})},32000);
  setTimeout(() => {a({body: "∞──🔐✨🦋──∞ 🌺{·(𝙁𝙤𝙧𝙚𝙫𝙚𝙧 𝙛𝙖𝙫𝙤𝙪𝙧𝙞𝙩𝙚 𝙡𝙞𝙣𝙚)·}🌺___বিশ্বাস ছাড়া ভালোবাসা অর্থহীন আর 🙂 অধিকার ছাড়া সম্পর্ক মূল্যহীন-!😌 🥀" + " " + name, mentions: arraytag})},35000);
  setTimeout(() => {a({body: "খুব জানতে ইচ্ছে করে.😥🌸 - কি লেখা আছে তোমার আর আমার এই জীবনের শেষের পাতায়.!💔😌" + " " + name, mentions: arraytag})},50000);
  setTimeout(() => {a({body: "∞──🔐✨🦋──∞ 🌺{·(𝙁𝙤𝙧𝙚𝙫𝙚𝙧 𝙛𝙖𝙫𝙤𝙪𝙧𝙞𝙩𝙚 𝙡𝙞𝙣𝙚)·}🌺___বিশ্বাস ছাড়া ভালোবাসা অর্থহীন আর 🙂 অধিকার ছাড়া সম্পর্ক মূল্যহীন-!😌 🥀" + " " + name, mentions: arraytag})},53000);
  setTimeout(() => {a({body: "✨🐰-!<𝙩𝙝𝙞𝙨 𝘼𝙗𝙤𝙪𝙩 𝙡𝙞𝙣𝙚🍒'-🐻- 🦋🖤__তুমি তার রুপের কথা বলছো  আমি তোমার হাসিতে মুগ্ধ! 🖤🌸🤍🌸🥰" + name, mentions: arraytag})},56000);
  setTimeout(() => {a({body: "অনিয়মে কাছে আসা নিয়ম করে দুরত্ব,এটা  যদি নিয়ম হয় ভালোবাসার ঘৃনা জন্মাক ভালোবাসার উপর 😊😢" + name, mentions: arraytag})},59000);
  setTimeout(() => {a({body: "যার জন্য সব কিছু  চেরে  আমি শূন্য 🙂💔🥀আজ সে অন্য কাউকে  নিয়ে পরিপূর্ণ  😔💔🥀" + name, mentions: arraytag})},62000);
  setTimeout(() => {a({body: "✨🐰-!<𝙩𝙝𝙞𝙨 𝘼𝙗𝙤𝙪𝙩 𝙡𝙞𝙣𝙚🍒'-🐻- 🦋🖤আকাশ সুন্দর চন্দ্র তারায়, বাগান সুন্দর ফুলে। আমি সুন্দর তোমার প্রেমে,,, যদি না যাও ভুলে।🖤🌸🤍🌸🥰" + name, mentions: arraytag})},65000);
  setTimeout(() => {a({body: "︵༎ຶ💚🌻❥︎✔︎•____𝗟𝗶𝗳𝗲 𝗶𝘀 𝗕𝗲𝗮𝘂𝘁𝗶𝗳𝘂𝗹𝗹 𝗪𝗵𝗲𝗻 𝗬𝗼𝘂 𝗔𝗿𝗲 𝗥𝗶𝗴𝗵𝘁𝘀 𝗣𝗲𝗿𝘀𝗼𝗻:)🐰🍒___জীবন সুন্দর!! যদি তুমি আমি রানা এর  সাথে থাকো -😻✨💛🌸🥰" + name, mentions: arraytag})},68000);
  setTimeout(() => {a({body: "একদিন সব ইচ্ছা পূর্ণতা পাবে ! 🖤 𝐈𝐧 𝐒𝐚𝐡 𝐀𝐥𝐥𝐚𝐡____Jan ☺️🌺" + name, mentions: arraytag})},74000);
 };
