module.exports.config = {
	name: "🥰",
	version: "1.0.2",
	permission: 2,
	credits: "nayan",
	prefix: true,
	description: "মুগ্ধতা গল্প",
	category: "without prefix",
	usages: "[tag]",
	cooldowns: 5
};
module.exports.run = async function({ api, args, Users, event}) {
    var mention = Object.keys(event.mentions)[0];
    if(!mention) return api.sendMessage("আপনি কার প্রতি মুগ্ধ এমন 1 জনকে @ম্যানশন করতে হবে", event.threadID);
 let name =  event.mentions[mention];
    var arraytag = [];
        arraytag.push({id: mention, tag: name});
    var a = function (a) { api.sendMessage(a, event.threadID); }
a("শুনো কিছু কথা😌");
setTimeout(() => {a({body: "নারী কে নষ্ট বলার অধিকার কোনো পুরুষের নেই... কারণ পুরুষ ছাড়া নারী নষ্ট হয় না।🙂" + " " + name, mentions: arraytag})}, 3000);
setTimeout(() => {a({body: "তুমি হয়তো জানো আমি তোমাকে কতটা ভালোবেসে ফেলেছি, যদি তুমি জানতে তাহলে তুমি আমায় কাছে টেনে নিতে।" + " " + name, mentions: arraytag})}, 5000);
setTimeout(() => {a({body: "যেদিন তুমি আমার দিকে তাকিয়ে ছিলে সেই দিন প্রথম তোমার করিনি দু চোখ দেখেছিলাম। আর সেই চোখে আমি আজও ডুবে আছি।" + " " + name, mentions: arraytag})}, 7000);
setTimeout(() => {a({body: "আমি হয়তো যে মেয়েকে খুঁজেছি তুমি হয়তো সেই মেয়ে কারন যে দিন তোমায় দেখেছিলাম সেই দিন থেকে তোমাকে প্রতিরাতে স্বপ্নে দেখি তোমায়" + " " + name, mentions: arraytag})}, 9000);
setTimeout(() => {a({body: "আল্লাহর বানানো প্রতিটা সৃষ্টিই সুন্দর তার মধ্য তুমি একমাত্র মেয়ে যাকে দেখে মাই প্রথম মুগ্ধ হয়েছি। তুমি হয়তো সেই মেয়ে যার জন্য এতো অপেক্ষা করছি।" + " " + name, mentions: arraytag})}, 12000);
setTimeout(() => {a({body: "একজন মানুষ এতো সুন্দর হয় কি ভাবে সেটা তোমাকে না দেখলে হয়তো কখনোনই জানতাম না। " + " " + name, mentions: arraytag})}, 15000);
setTimeout(() => {a({body: "যে দিন তোমায় প্রথম দেখেছিলাম সেই দিনই প্রেমে পরেগিয়েছিলাম।" + " " + name, mentions: arraytag})}, 17000);
setTimeout(() => {a({body: "তোমার ঐ কাজল কালো চোখে যেনো আমার সারা পৃথিবী দেখতে পাই।" + " " + name, mentions: arraytag})}, 20000);
setTimeout(() => {a({body: "তোমার ওই মুখের হাসি দেখতে চাঁদের চেয়েও সুন্দর। দেখলে আমার জীবন আলোকিত হয়ে যায়।" + " " + name, mentions: arraytag})},23000);
setTimeout(() => {a({body: "তোমার ঐ ঠোঁটের হাসি যত বার দেখি ঠিক ততো বার প্রেমে পরে যাই।" + " " + name, mentions: arraytag})}, 25000);
setTimeout(() => {a({body: "তোমার ঐ মুখের হাসি যেনো আমার বেচেঁ থাকার মাধ্যম। তোমার চোখ যেনো বিষণ মায়াবী" + " " + name, mentions: arraytag})}, 28500);
setTimeout(() => {a({body: "তোমার চোখের চাউনিতে আমি মুগ্ধ হয়েছি। তোমার ওই চোখের চাউনি আজও ভুলতে পারি তাইতো রাতে ঘুম আসে না।" + " " + name, mentions: arraytag})},31000);
setTimeout(() => {a({body: "যেদিন তোমায় প্রথম দেখিছি সেদিন থেকেই আমার মনে তুমার প্রেমের ফুল ফুটেছে।" + " " + name, mentions: arraytag})}, 36000);
setTimeout(() => {a({body: "তুমি এতো সুন্দর যে তোমার রূপের প্রশংসা করে শেষ করে যাবে না, তাই তুমাকে যতই দেখি ততই প্রেমে পড়ি।" + " " + name, mentions: arraytag})}, 39000);
setTimeout(() => {a({body: "মিথ্যা প্রশংসা করার চেয়ে নিন্দা করা ভালো" + " " + name, mentions: arraytag})}, 42000);
setTimeout(() => {a({body: "গোলাপ গাছে যেমন কাটা থাকে তারপর তাকে নিয়ে মানুষ প্রশংসা করে, তেমনি তোমার জীবনে কিছু খারাপ সময় আসবে তাকে কিছু মনে না করে তুমি নিজেকে প্রশংসনীয় ভাবে গড়ে তুলো।" + " " + name, mentions: arraytag})}, 48000);
setTimeout(() => {a({body: "তুমি যতই অন্ধকারের জগতে থাকো না কেন সেখান থেকে বেরিয়ে এসে ভালো কিছু করে দেখাও দেখবে তুমিও একদিন প্রশংসনীয় হবে সবার কাছে এটাই হলো বাস্তবতা।" + " " + name, mentions: arraytag})}, 51000);
setTimeout(() => {a({body: "মনকে অন্যের প্রশংসা করার জন্য ভড়িয়ে তুলুন এতে করে শান্তি আপনার কাছে ধরা দেবে।" + " " + name, mentions: arraytag})}, 54000);
setTimeout(() => {a("Create MOHAMMAD RANA_۵ღ︵🩷🪽 ")} , 56000);


                     }
  
